import { Content } from "../interface/content";

const contents: Content[] = [{
    "contentId": 0,
    "title": "수리남",
    "actor": ["하정우", "이정재", "황정민", "박혜수"],
    "genre": ["범죄 시리즈", "한국 드라마", "스릴러 시리즈"],
    "feature": ["긴장감 넘치는"],
    "thumbnail": "썸네일 이미지",
    "year": 2022,
    "ageLimit": 18,
    "rank": 8,
    "episodes": [{
        "episode": 1,
        "description": "새로운 사업을 위해 공장을 알아보러 간 강민구. 하지만 졸지에 세력 싸움에 휘말리고 만다. 이때, 현지의 목사가 인구를 돕겠다고 나선다."
    }, {
        "episode": 2,
        "description": "변호사 선임을 망설이던 인구는 비밀 요원의 제안을 고려한다. 이후 인구는 전직 보디가드를 속이기 위해 감옥 내 영향력을 키우고자 하는데."
    }, {
        "episode": 3,
        "description": "전요환과 구상만 사이의 파트너십을 중재하는 인구. 요환은 거래에 동의하기에 앞서 철저하게 조사를 진행한다."
    }, {
        "episode": 4,
        "description": "국경에서 충돌이 발생하고, 요환 측근들 사이의 기류가 변화한다. 상만은 한국으로 향하는 다른 경로를 제안한다."
    }, {
        "episode": 5,
        "description": "경로를 변경하도록 요환을 설득하는 데 실해판 인구. 결국 임기응변을 발휘해 새로운 계획을 설계한다. 데이빗 홀리오 박은 패키지 전달을 준비한다."
    }, {
        "episode": 6,
        "description": "요환의 갑작스러운 돌발 행동으로 인구의 신변을 보호하기 위한 계획에 차질이 생긴다. 요환의 마약제국을 무너뜨리기 위한 작전이 시작되고, 그 사이 이상준이 공항에 도착한다."
    }],
    "episodeCount": 6
}, {
    "contentId": 1,
    "title": "이상한 변호사 우영우",
    "actor": ["박은빈", "강태오", "강기영"],
    "genre": ["법정 시리즈", "한국 드라마", "사회 문제를 다룬 드라마"],
    "feature": ["힐링", "감명을 주는", "진심 어린"],
    "thumbnail": "썸네일 이미지",
    "year": 2022,
    "ageLimit": 15,
    "rank": 1,
    "episodes": [{
        "episode": 1,
        "description": "대형 로펌 한바다에 첫 출근하게 된 영우. 멘토 변호사 명석은 영우에게 남편을 폭행한 할머니 사건을 맡겨 시험하기로 한다. 영우는 신입 변호사로 인정받을 수 있을까."
    }, {
        "episode": 2,
        "description": "성대한 결혼식에서 신부의 웨딩드레스가 벗겨지는 사고가 발생한다. 한바다는 호텔을 상대로 10억 청구 소송을 진행하게 되고, 영우는 준호와 일일 커플이 되어 호텔 잠입 조사를 벌인다."
    }, {
        "episode": 3,
        "description": "친형을 폭행하여 죽음에 이르게 한 중증 자폐인이 기소된다. 영우는 자폐를 지닌 피고인과 소통하기 위해 기발한 방법을 생각해 내고, 한바다 변호사들을 불러 모은다."
    }],
    "episodeCount": 3
}];

export default contents;
